Revit 2027 API
ParameterTypeId.StairsTrisertypeNosingProfile Property
 "Nosing Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsTrisertypeNosingProfile { get; }
Public Shared ReadOnly Property StairsTrisertypeNosingProfile As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsTrisertypeNosingProfile {
	ForgeTypeId^ get ();
}
static member StairsTrisertypeNosingProfile : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace